backend/app/jobs/analyze_document_job.rb

UPDATE "documents" SET "status" = 'failed', "ai_data" = '{"error":"The model returned the following errors: The detected file MIME type image/jpeg does not match the expected type application/pdf. Reformat your input and try again."}', "updated_at" = '2025-12-28 15:01:49.403780' WHERE "documents"."id" = 2
UPDATE "documents" SET "status" = 'completed', "doc_type" = 'Cedolino', "ai_data" = '{"tipo_documento":"Cedolino","data_competenza":"08/05/2017","codice_fiscale":"LDZNRR80A41D0548V","dipendente":"LAZONI E UNIVERSITA'' 2017"}', "updated_at" = '2025-12-28 15:06:08.371851' WHERE "documents"."id" = 4
---
  def perform(document_id)
    # Carica documento dal DB
    # .find lancia ActiveRecord::RecordNotFound se ID non esiste
    doc = Document.find(document_id)

    # Guard clause: esci se documento nil (non dovrebbe succedere con find)
    return unless doc

    # update_column = UPDATE SQL diretta senza callbacks/validations
    # Più veloce di update! quando cambi solo 1 campo
    # status = "processing" indica che analisi è in corso
    doc.update_column(:status, "processing")

    # Chiama service per analisi documento
    # DocumentAnalysisService.analyze:
    # 1. Legge file da ActiveStorage
    # 2. Chiama Bedrock InvokeModel per estrazione dati
    # 3. Ritorna Hash con: tipo_documento, extracted_text, entities, summary
    analysis_data = DocumentAnalysisService.analyze(doc)

    # Salva risultati analisi nel DB
    # update! = UPDATE con validazioni, solleva eccezione se fallisce
    doc.update!(
      status: "completed",                      # Analisi completata con successo
      doc_type: analysis_data["tipo_documento"], # Es. "pdf", "docx", "txt"
      ai_data: analysis_data,                    # JSON con tutti dati estratti
      updated_at: Time.current                   # Timestamp aggiornamento
    )