backend/app/jobs/analyze_document_job.rb

  def perform(document_id)
    doc = Document.find(document_id)
    doc.update(status: "processing")

    # Usa il service per l'analisi
    analysis_data = DocumentAnalysisService.analyze(doc)

    # Salva i risultati
    doc.update!(
      status: "completed",
      doc_type: analysis_data["tipo_documento"],
      ai_data: analysis_data
    )
  rescue DocumentAnalysisError => e
    # Errore di analisi (formato non supportato, Bedrock fallisce, ecc.)
    Rails.logger.error("Document analysis error: #{e.message}")
    doc.update(status: "failed", ai_data: { error: e.message })
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = 5 LIMIT 1
UPDATE "documents" SET "status" = 'processing', "updated_at" = '2025-12-28 15:40:40.560986' WHERE "documents"."id" = 5
UPDATE "documents" SET "status" = 'completed', "doc_type" = 'Cedolino', "ai_data" = '{"tipo_documento":"Cedolino","data_competenza":"08/05/2017","codice_fiscale":"7862","dipendente":"LAZONE E UNIVERISITA'' 2017"}', "updated_at" = '2025-12-28 15:41:30.745121' WHERE "documents"."id" = 6
UPDATE "documents" SET "status" = 'failed', "ai_data" = '{"error":"Bedrock error: The security token included in the request is expired"}', "updated_at" = '2025-12-28 15:40:41.833285' WHERE "documents"."id" = 5