backend/app/services/ai_service.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
SELECT "tones".* FROM "tones" WHERE "tones"."company_id" = 1 AND "tones"."name" = 'Simpatico' LIMIT 1
INSERT INTO "messages" ("content", "conversation_id", "created_at", "role", "updated_at") VALUES ('Scrivi un''email di presentazione del prodotto asciugacapelli per pelati.', 12, '2025-12-22 16:40:06.678865', 'user', '2025-12-22 16:40:06.678865') RETURNING "id"
---
  def genera(testo_utente, company_id, nome_tono, conversation_id: nil)
    company = Company.find(company_id)
    conversation = @conversation_manager.fetch_or_create_conversation(company, conversation_id)

    tono_db = company.tones.find_by(name: nome_tono)
    istruzioni_tono = tono_db&.instructions.presence || "Rispondi in modo professionale."
    descrizione_azienda = company.description.presence || ""

    system_prompt = @prompt_builder.build_system_prompt(company.name, descrizione_azienda, istruzioni_tono)

    # Preleva lo storico della conversazione
    context_messages = @conversation_manager.get_context_messages(conversation)

    # Normalizza/normalizza i messaggi per la Converse API
    messages = @prompt_builder.normalize_messages(context_messages, testo_utente)

    output_text = @text_generator.generate_text(messages, system_prompt)

    # Persistenza dei messaggi
    @conversation_manager.save_messages(conversation, testo_utente, output_text)