backend/app/services/ai_service.rb

INSERT INTO "conversations" ("company_id", "created_at", "summary", "title", "updated_at") VALUES (1, '2025-12-21 21:19:19.850363', NULL, NULL, '2025-12-21 21:19:19.850363') RETURNING "id"
INSERT INTO "conversations" ("company_id", "created_at", "summary", "title", "updated_at") VALUES (1, '2025-12-22 16:52:18.105619', NULL, NULL, '2025-12-22 16:52:18.105619') RETURNING "id"
---

    # Salva i messaggi nel DB (storico conversazione)
    # .create! = crea nuovo record, solleva eccezione se fallisce
    conversation.messages.create!(role: "user", content: testo_utente)
    conversation.messages.create!(role: "assistant", content: output_text)