backend/app/controllers/documents_controller.rb

  def create
    company_id = params[:company_id]
    return render json: { error: "company_id mancante" }, status: :bad_request if company_id.blank?

    company = Company.find_by(id: company_id)
    return render json: { error: "Azienda non trovata" }, status: :not_found unless company

    @document = company.documents.build(document_params)

    if @document.save
---
INSERT INTO "documents" ("status", "doc_type", "ai_data", "created_at", "updated_at") VALUES ('pending', NULL, NULL, '2025-12-28 14:49:48.030501', '2025-12-28 14:49:48.030501') RETURNING "id"

  def show
    @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = 1 LIMIT 1