backend/app/controllers/generator_controller.rb

  def create
    prompt     = params[:prompt]
    tone_name  = params[:tone]
    company_id = params[:company_id]
    conversation_id = params[:conversation_id]

    if prompt.blank? || tone_name.blank? || company_id.blank?
      return render json: { error: "prompt, tone e company_id sono obbligatori" }, status: :unprocessable_entity
    end

    result = AiService.new.genera(prompt, company_id, tone_name, conversation_id: conversation_id)
    render json: result, status: :ok
  rescue ActiveRecord::RecordNotFound => e
    Rails.logger.error "Record non trovato: #{e.message}"
    render json: { error: "Azienda, tono o conversazione non trovati" }, status: :not_found
  rescue => e
    Rails.logger.error "Errore interno: #{e.class} - #{e.message}\n#{e.backtrace.join("\n")}"
---
SELECT "tones".* FROM "tones" WHERE "tones"."company_id" = 1 AND "tones"."name" = 'Formale' LIMIT 1
SELECT "tones".* FROM "tones" WHERE "tones"."company_id" = 1 AND "tones"."name" = 'Simpatico' LIMIT 1

  def index
    company_id = params[:company_id]
    return render json: { error: "company_id mancante" }, status: :bad_request if company_id.blank?

    company = Company.find_by(id: company_id)
    return render json: { error: "Azienda non trovata" }, status: :not_found unless company

    tones = company.tones.select(:id, :name, :instructions)
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1
SELECT "tones"."id", "tones"."name", "tones"."instructions" FROM "tones" WHERE "tones"."company_id" = 1

  def conversations
    company_id = params[:company_id]
    return render json: { error: "company_id mancante" }, status: :bad_request if company_id.blank?

    conversations = Conversation.where(company_id: company_id).order(updated_at: :desc).limit(50)
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."company_id" = 1 ORDER BY "conversations"."updated_at" DESC LIMIT 50

  def show_conversation
    conversation = Conversation.includes(:messages).find(params[:id])

    if params[:company_id].present? && conversation.company_id.to_s != params[:company_id].to_s
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1